Repository: 84000/data-translation-memory
Catalog: toh136-v3.tmx
Source language: bo
Languages: en

source: ཁྱོད་ཀྱིས་སྡིག་པའི་ལས་མཛད་པ། །མཚམས་མེད་འཇིགས་པ་ཆེན་པོ་ལགས། །དེ་ཡིས་ཁྱོད་ནི་མནར་མེད་པ། །མི་བཟད་འཇིགས་པ་ཆེན་པོར་ལྟུང་། །
en: “The evil deed you committed Is a terrible crime of immediate retribution For which you will plummet into the terrible hells Of unbearable and unceasing torment.

source: སངས་རྒྱས་ལ་ནི་སེམས་དད་མཛོད། །
en: “Have faith in the Buddha!

source: དེས་ནི་ཐར་པ་འཐོབ་འགྱུར་ཞིང་། །
en: For through it you will attain liberation.

source: མི་དབང་དེ་ནས་རྐྱེན་རྣམས་ཀྱིས། །ཁྱོད་ཀྱིས་རྫོགས་པའི་བྱང་ཆུབ་འཐོབ། །
en: Lord of men, such conditions will then lead you To the attainment of perfect awakening.

source: ཁྱོད་ཀྱིས་སྡིག་པའི་གྲོགས་བསྟེན་པ། །ལྷ་སྦྱིན་གནོད་བྱེད་ཆེན་པོ་ལགས། །དེ་ཡི་རྗེས་སུ་ཕྱོགས་ནས་ནི། །
en: “You have relied on evil companions; Devadatta is deeply harmful.

source: ཁྱོད་ཀྱིས་ཡབ་ནི་བཀྲོངས་པར་གྱུར། །
en: Under his influence You killed your own father.

source: ཁྱོད་ཀྱི་ཡབ་ནི་ཆོས་སྤྱོད་པ། །སངས་རྒྱས་ཐུགས་ལས་སྐྱེས་པའི་སྲས། །
en: “Your father practiced the Dharma; He was the Buddha’s heir, his heart son.

source: ཁྱོད་ཀྱིས་ང་རྒྱལ་དེ་ཡིས་ནི། །མཁས་པ་པོ་ནི་བསད་པར་གྱུར། །
en: In your arrogance You murdered this wise man.

source: རྫོགས་སངས་མྱ་ངན་མ་འདས་པར། །ཁྱོད་ཀྱིས་གཟིགས་པར་མི་བགྱི་འམ། །དེ་ཡི་སྐུ་གདུང་རྣམས་ལ་ཡང་། །མཆོད་པ་རྒྱ་ཆེན་དག་ཀྱང་མཛོད། །
en: “If you cannot see the perfect Buddha Before he passes into nirvāṇa, Then at least make extensive offerings To his sacred remains.

source: བདག་ནི་ཞིང་འདིར་མཆིས་པ་ཡང་། །འདོད་པའི་ཡོན་ཏན་ཕྱིར་མ་ལགས། །བདག་ནི་སངས་རྒྱས་བལྟར་མཆིས་ཀྱིས། །
en: “I did not come to this realm For its sense pleasures; I came here to see the Buddha.

source: རྒྱལ་པོ་ཆེན་པོ་བཟོད་པར་མཛོད། །
en: Great king, have patience.

source: ཤཱཀྱ་སེང་གེ་དྲང་སྲོང་ཆེ། །དེ་ནི་དེ་རིང་འདའ་འགྱུར་ཞེས། །སངས་རྒྱས་སེང་གེའི་སྒྲ་དེ་ཡི། །སྤྱན་སྔ་ནས་ནི་བདག་གིས་ཐོས། །
en: “While in the presence of the Buddha Siṃhanāda, I heard that the lion of the Śākyas, The great sage, Will pass away today.

source: དེ་ལ་བལྟ་བའི་ཆེད་དུ་བདག །ཞིང་འདིར་མཆིས་པར་གྱུར་པ་ལགས། །རྒྱལ་རིགས་ཉེ་དུའི་ཚོགས་ཀུན་དང་། །ལྷན་ཅིག་འགྲོགས་ཏེ་མཆི་བར་བགྱི། །
en: “It is in order to see him That I am here in this realm, So let us go, accompanied by All the royal kinsmen and their people.”

source: དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་ཁྱེའུ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། འདི་ནས་གྱད་ཡུལ་ལམ་རིང་མ་སྨད་པ། །རྐང་པས་བགྲོད་པར་མི་ནུས་ཤིང་རྟས་སོང་། །
en: King Ajātaśatru then replied to the child in verse: “The road from here to the Malla kingdom is long; One cannot possibly go by foot, only by carriage.

source: ཁྱེའུ་ཁྱོད་དོ་མོད་སྡོད་པར་གྱིས་ཤིག་དང་། །དཔུང་ཆེན་རྣམས་ཀྱིས་བདེ་བར་འདོང་བར་བྱ། །
en: Child, you will stay here tonight, And we will travel in comfort with a large army.”

source: དེ་ནས་ཁྱེའུ་དེས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། མི་དབང་ཁྱོད་ལྟར་བདག་ལ་ལེ་ལོ་མེད། །
en: The child then replied to King Ajātaśatru: “Lord of men, I am not lazy like you!

source: བསམ་ཡས་རྫུ་འཕྲུལ་སྟོབས་ནི་བདག་ལ་ཡོད། །
en: I have inconceivable miraculous powers.

source: བདག་ནི་འདོད་ན་ཤར་ཕྱོགས་ཞིང་རྣམས་ནི། །དུ་བ་མ་དག་ཏུའང་ཐོགས་མེད་འགྲོ་འགྱུར་ཞིང་། །
en: If I so wish, I could travel unhindered Throughout the many eastern realms.

source: བདག་ནི་གང་ནས་འོངས་པའི་འཇིག་རྟེན་ཁམས། །དེ་ཡི་བར་ན་སངས་རྒྱས་ཞིང་མང་གང་། །དེ་ཡང་མཐའ་ཡས་མང་པོ་ཚད་མེད་པས། །གྱད་ཡུལ་ལྟ་ཞིག་ཇི་ལྟར་གྱུར་ཀྱང་རུང་། །
en: “Between here and the world from which I have come, There are so many buddha fields, Boundless and immeasurable, So reaching the Malla kingdom will be all right!”

source: དེ་ནས་ཁྱེའུ་དེ་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་པང་པ་ནས་བབས་ནས་རྐང་པས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ནས་བྱུང་སྟེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །གང་ཞིག་སྡིག་མེད་ཉོན་མོངས་ཡོད་མིན་ཞིང་། །སྟོབས་ཆེན་གསུང་མཆོག་མི་དབང་ལྟ་འདོད་པ། །
en: The boy then jumped down from King Ajātaśatru’s lap and left Rājagṛha on foot, and as he left, he spoke this verse: “Anyone who does no wrong, who is free of affliction And longs to see the mighty one, supreme in speech, the lord of men, Come now, and follow me!

source: དེ་ནི་ཁོ་བོའི་ཕྱི་བཞིན་དེང་ཤོག་དང་། །ཤཱཀ་ཐུབ་མྱ་ངན་མ་འདས་དེ་མཐོང་འགྱུར། །
en: We will see Śākyamuni before he passes away!”

source: ཁྱེའུ་དེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ནས་བྱུང་མ་ཐག་ཏུ་དེ་ནས་སྐད་ཅིག་དེ་དང་ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་ལྷ་དང་མིར་བཅས་པའི་སྐྱེ་དགུ་ལས་སྲོག་ཆགས་བདུན་ཁྲི་ཉིས་སྟོང་འདུས་པར་གྱུར་ནས། ཁྱེའུ་དེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་བའི་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་གྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ངོ་། །བཅོམ་ལྡན་འདས་སེང་གེའི་གཟིམས་ཁྲི་ལ་སྐུའི་གློ་གཡས་པས་ཕབ་སྟེ་གཟིམས་མ་ཐག་ཏུ་དེ་ནས་སྐད་ཅིག་དེ་དང་།
en: As soon as the child departed the city of Rājagṛha, at that moment, right then, at that very instant, in addition to gods and humans, seventy-two thousand creatures of all kinds gathered around as the child, escorted by an entourage of billions upon billions of gods who pay homage at the feet of the Blessed One, proceeded to where the Blessed One was.

source: ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་ལྷོ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་འབུམ་ཕྲག་ལྔ་འདས་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལྟ་མཛེས་རིན་ཆེན་བརྩེགས་ཞེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱ་བ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་ཞི་བར་འཇུག་ཅེས་བྱ་བ་ཤི་འཕོས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་འཛམ་བུའི་གླིང་འདི་ཉིད་དུ་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་ཚོང་དཔོན་སེང་གེ་ལྟ་བུ་ཞེས་བྱ་བའི་ཁྱིམ་དུ་སྐྱེས་སོ། །
en: As soon as the Blessed One had lain down on his right side upon the lion couch, between a pair of śāla trees, at that moment, right then, at that very instant, five trillion buddha fields away to the south in the world called Ratnavyūha, the buddha field of the thus-gone, worthy, perfect buddha Beautiful Heap of Jewels, a bodhisattva great being called Thoroughly at Peace passed away and was reborn in this buddha field of Jambudvīpa, in the great city of Śrāvastī, in the household of the eminent merchant called Leonine.

source: དེ་སྐྱེས་མ་ཐག་ཏུ་ཆེད་དུ་བརྗོད་པ་འདི་སྐད་ཆེད་དུ་བརྗོད་དོ། །གང་ཕྱིར་བསྐལ་པ་བྱེ་སྙེད་དུ། །གང་གིས་ཕྱག་ཀྱང་ཡང་ཡང་གཏུབས། །
en: The moment he was born, he spoke up, and he spoke with purpose: “Over so many eons, Again and again, he severed his limbs.

source: སྤྱན་དང་རང་གི་ཤ་དག་དང་། །དེ་བཞིན་དབུ་ཡང་བཏང་མཛད་ཅིང་། །
en: He gave away his own eyes, his own flesh, Even his own head.

source: སངས་རྒྱས་ཉིད་ནི་བཞེད་པ་ཡིས། །
en: “In his wish to attain buddhahood, He gave away queens, princes, and princesses.

source: བསྐལ་པ་སྟོང་ཕྲག་བྱེ་བར་ཡང་། །བཙུན་མོ་སྲས་དང་སྲས་མོ་དང་། །བདོག་པ་ཐམས་ཅད་ཡང་ཡང་བཏང་། །
en: He gave away all his possessions, again and again, For ten billion eons.

source: སེམས་ཅན་རྣམས་ནི་དགྲོལ་བའི་ཕྱིར། །བསྐལ་པ་བྱེ་བ་བརྒྱ་མང་དུ། །སྦྱིན་པ་རྒྱ་ཆེན་བཏང་གྱུར་པའི། །སྤྱན་དང་ལྡན་པ་བཞུགས་སམ་ཅི། །
en: “He who gave so expansively Over so many billions of eons For the sake of liberating beings— Is that seer still here?”

source: དེ་ནས་ཚོང་དཔོན་སེང་གེ་ལྟ་བུས་ཁྱེའུ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། གང་ཕྱིར་སྐྱེས་མ་ཐག་ཏུ་ཡང་། །ཚིག་མཆོག་རྗོད་པར་བྱེད་པ་ཁྱོད། །
en: The eminent merchant Leonine replied to the child in verse: “How is it you speak such excellent words As soon as you are born?

source: ལྷ་འམ་འོན་ཏེ་ཀླུ་ཞིག་གམ། །
en: Are you a god, or else a nāga?

source: གནོད་སྦྱིན་ཡིན་ནམ་སྲིན་པོ་ཡིན། །
en: Are you a yakṣa, or a rākṣasa?

source: ཉེ་དུའི་ཚོགས་ནི་སྐྲག་གྱུར་ཅིང་། །འཇིགས་པས་ཕྱོགས་སུ་རྣམ་པར་རྒྱུག །ཁོ་བོ་སངས་རྒྱས་སྒྲ་ཡིས་ནི། །གཞན་དུ་འབྲོས་པར་མི་བྱེད་ཁྱེའུ། །
en: “My relatives have taken fright, Running here and there in fear, But, child, the voice of a buddha Does not make me flee.”

source: དེ་ནས་ཁྱེའུ་དེས་ཚོང་དཔོན་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ཁོ་བོ་ལྷ་མིན་ཀླུ་ཡང་མིན། །གནོད་སྦྱིན་མ་ཡིན་སྲིན་པོའང་མིན། །
en: Then the child said to the merchant: “I am not just a god, nor a nāga, Not just a yakṣa or a rākṣasa.

source: འཇིག་རྟེན་ཐུན་མོང་ཡིན་པའི་ཕྱིར། །
en: For they are ordinary worldly beings!

source: ཅི་འདྲ་ཚོང་དཔོན་མི་ཤེས་སམ། །
en: Why, merchant, do you not know?

source: ཁོ་བོ་ལྷ་ཀླུ་གནོད་སྦྱིན་དང་། །མི་འམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེ། །ལྷ་ཡི་ལྷ་ཞེས་བརྟན་པ་ནི། །
en: “Called ‘god of gods,’ I am god, nāga, yakṣa, Kinnara, and mahoraga!

source: ཁྱུ་མཆོག་བཞིན་དུ་དམ་ཡང་འཆའ། །
en: I am bound by my promise, like a bull.”

source: དེ་ནས་ཚོང་དཔོན་སེང་གེ་ལྟ་བུས་ཁྱེའུ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། མཁས་པ་ཁྱོད་ཀྱིས་བསྒྲགས་པ་ཡི། །དེ་འདྲའི་ཚིག་ནི་ཐོས་གྱུར་ནས། །ཐེ་ཚོམ་ལྷག་པར་སྐྱེས་གྱུར་ཅིང་། །
en: The merchant Leonine then said to the child in verse: “Wise one, I have heard The words you have spoken, But I have doubts about what they mean.

source: ཁོ་བོ་ལྷག་པར་བསྔགས་སོ་ཁྱེའུ། །
en: I would speak further of it to you, child.

source: ཇི་ལྟར་ཁྱོད་ནི་ལྷ་དང་ཀླུ། །
en: “Tell me, child: How is it you are god and nāga?

source: ཇི་ལྟར་གནོད་སྦྱིན་མི་འམ་ཅི། །
en: How are you yakṣa and kinnara?

source: ཇི་ལྟར་ལྷ་ཡི་ལྷ་ཡིན་པ། །དེ་ནི་ཁྱེའུ་ཁྱོད་ང་ལ་སྨྲོས། །
en: How are you god of gods?”

source: དེ་ནས་ཁྱེའུ་དེས་ཚོང་དཔོན་སེང་གེ་ལྟ་བུ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ལྷོ་ཡི་ཕྱོགས་ཆ་ལོགས་ན་ནི། །གསུང་བར་མཛད་པའི་བདག་པོ་ནི། །ལྟ་མཛེས་རིན་ཆེན་བརྩེགས་བཞུགས་པ། །
en: The child replied to the merchant Leonine in verse: “In the south Lives the lord of speech Beautiful Heap of Jewels.

source: དེ་ནས་ཁོ་བོ་འདིར་འོངས་ཏེ། །
en: It is from there that I have come.

source: ཁོ་བོ་ལན་བརྒྱར་བརྒྱ་བྱིན་དང་། །དབང་སྒྱུར་དུ་ཡང་ཁོ་བོ་གྱུར། །
en: “But a hundred times I have been Śakra; I have reigned.

source: ཁོ་བོ་ལན་བརྒྱར་ཚངས་པ་དང་། །དེ་བཞིན་འཁོར་ལོས་སྒྱུར་བར་གྱུར། །
en: A hundred times I have been Brahmā; I have been a universal monarch.

source: ཁོ་བོས་ཡུན་རིང་བརྗོད་བྱ་ན། །བསྐལ་པའམ་བསྐལ་པ་བྱེ་བར་ཡང་། །ཟད་པར་འགྱུར་བ་ཡོད་མིན་ཏེ། །
en: “If I had to describe those births in detail, Millions upon millions of eons would pass, And still it would not be over.

source: མཁས་པ་ཁོ་བོ་འགྲོ་དགོས་སོ། །
en: And, learned one, I must go.”

source: ཚོང་དཔོན་འོན་ཀྱང་རེ་ཞིག་རྗེས་སུ་བསྟན་པ་འདི་ལ་ཁྱོད་ཀྱིས་ཀུན་ཏུ་བསྟེན་པར་བྱ། ངེས་པར་བསྟེན་པར་བྱ།
en: “However, great merchant, you should henceforth rely on the following teaching.

source: གོམས་པར་བྱ་ཞིང་ལན་མང་དུ་བྱའོ། །
en: Rely on it with confidence and contemplate it many times over.

source: ཚོང་དཔོན་རྗེས་སུ་བསྟན་པ་དེ་ཡང་གང་ཞེ་ན།
en: Great merchant, what is this teaching?

source: ཚོང་དཔོན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལྟ་མཛེས་རིན་ཆེན་བརྩེགས་དེས་འདི་སྐད་ཅེས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གསུམ་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་གསུངས་པ་སྟེ།
en: Great merchant, the blessed, thus-gone, worthy, perfect Buddha Beautiful Heap of Jewels has said, ‘When bodhisattva great beings have three qualities, they will be irreversible on the path to unsurpassed, completely perfect awakening, and they will swiftly awaken to complete, unsurpassed buddhahood.’

source: གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the three?

source: སེམས་མཐའ་ཡས་པའི་རྗེས་སུ་འཇུག་པ་དང་། ཡེ་ཤེས་ཟབ་མོའི་རྗེས་སུ་འཇུག་པ་དང་། སྙིང་པོ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་ལ་རྗེས་སུ་སྒོམ་པ་སྟེ།
en: They are being immersed in the limitless mind, being immersed in profound wisdom, and cultivating the sāravatī absorption.

source: ཚོང་དཔོན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གསུམ་པོ་དེ་དག་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: Eminent merchant, if bodhisattva great beings have these three qualities, they will be irreversible on the path to unsurpassed, completely perfect awakening and they will swiftly awaken to unsurpassed, completely perfect awakening.”

source: དེ་ནས་ཁྱེའུ་དེས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ཡེ་ཤེས་ཟབ་མོ་རྟོགས་དཀའ་དེ་ལ་ནི། །གང་དག་རྒྱུ་དང་རྒྱུ་མེད་ཀུན་མཁྱེན་པའི། །སངས་རྒྱས་གྲགས་ཆེན་རྣམ་དག་མ་གཏོགས་པ། །ལྷར་བཅས་སྐྱེ་དགུ་འདི་དག་སོམ་ཉི་བྱེད། །
en: Then the child spoke these verses: “Apart from pure illustrious buddhas, Who understand all things caused and uncaused, The profound wisdom, so difficult to realize, Creates doubt for all types of beings, including gods.

source: བྱང་ཆུབ་གནས་མིན་གང་ཡིན་དེ་མེད་དེ། །
en: “Since awakening is groundless, all there is is not.

source: ཡང་དག་ཡེ་ཤེས་གང་ལའང་ཆགས་པ་མེད། །
en: Genuine wisdom is beyond attachment.

source: ཆགས་པ་རྣམ་སྤངས་ཟུག་རྔུ་བྲལ་གྱུར་པའི། །ཡེ་ཤེས་རྣམ་པར་བསྒོམས་ན་སངས་རྒྱས་འགྱུར། །
en: It is by becoming familiar with the wisdom that has abandoned all forms of attachment And is devoid of pain that one becomes a buddha.

source: མཐའ་ཡས་སེམས་ལ་སེམས་ཡོད་མ་ཡིན་པར། །སེམས་ལ་འཇུག་པ་རབ་ཏུ་ཞི་བར་གསུངས། །
en: “In the limitless mind, the mind does not exist; To be immersed in such a mind is complete peace.

source: སེམས་འདི་ཐམས་ཅད་དག་ལས་ལོག་གྱུར་པའི། །རྗེས་སུ་རབ་ཏུ་འཇུག་པས་སེམས་ཞེས་བྱ།
en: This mind is called mind because even when turned away from all things, It remains thoroughly immersed in them.

source: གཅད་ཅིང་གཅག་རུང་གང་ཡིན་དེ་མི་སྲ། །
en: “That which can be cut or broken does not endure.

source: བདེ་གཤེགས་གསུངས་པའི་ཆོས་རྣམས་མི་ཕྱེད་ཅིང་། །དངོས་པོ་ཐམས་ཅད་ནམ་མཁའི་དངོས་འདྲ་བའི། །ཏིང་འཛིན་འདི་ནི་རྡོ་རྗེའི་རང་བཞིན་ཡིན། །
en: This absorption, indivisible from the qualities taught by the well-gone ones, In which all entities are like the vault of the sky, Is indestructible.

source: གང་གིས་དེ་འདྲར་རང་བཞིན་སྟོང་ཤེས་ནས། །དངོས་པོ་ཀུན་ལ་མི་གནས་སྒོམ་བྱེད་པ། །དེ་ནི་ཉོན་མོངས་དྲ་བ་ཀུན་སྤངས་ཤིང་། །སྲིད་པའི་འདོད་ཆགས་བཅོམ་པའི་སངས་རྒྱས་འགྱུར། །
en: “Those who meditate on the ephemerality of all entities, Understanding their empty nature in this way, Will loosen the web of afflictions And become buddhas who have conquered worldly desire.

source: ཐམས་ཅད་ཤེས་ཀྱང་རྣམ་ཤེས་ཡོད་མིན་ཞིང་། །
en: “Everything is understood, yet there is no understanding.

source: ཐམས་ཅད་སྒོམ་ཡང་རྣམ་སྒོམ་ཡོད་མིན་ལ། །
en: Everything is cultivated, yet there is no cultivation.

source: ཐམས་ཅད་རྟོགས་ཀྱང་རྟོགས་པ་ཡོད་མིན་ཞིང་། །
en: Everything is realized, yet there is no realization.

source: ཐམས་ཅད་བརྗོད་ཀྱང་གང་ལའང་མི་གནས་ལ། །
en: Everything is explained, yet there is nothing there at all.

source: ཟབ་ཆོས་ཆོས་ཀྱི་འདུ་ཤེས་ཡོད་མིན་ཞིང་། །
en: “The profound Dharma lacks any notion of Dharma.

source: སེམས་ཅན་འགྲོལ་ཡང་སེམས་ཅན་འདུ་ཤེས་མེད། །
en: Though beings are liberated, there is no notion of beings.

source: ཞི་དབེན་ཞི་བའི་འདུ་ཤེས་ཡོད་མིན་ཞིང་། །
en: In peaceful disengagement, there is no notion of peace.

source: བྱང་ཆུབ་རྟོགས་ཀྱང་བྱང་ཆུབ་འདུ་ཤེས་མེད། །
en: Though awakening is realized, there is no notion of awakening.

source: དཔའ་བརྟུལ་ལྟ་བའི་ཟུག་རྔུ་སྤངས་པ་དེ། །བསྟེན་དཀའ་འགྲོ་བ་ཀུན་ལས་འདས་གྱུར་ཅིང་། །
en: “The courageous who abandon the thorns of views Surpass all unreliable beings.

source: སེམས་ཅན་ཀུན་གྱི་འཆི་འཕོ་འགྲོ་དང་ཀུན། །རབ་ཏུ་ཤེས་ཤིང་རབ་བྱུང་སངས་རྒྱས་འགྱུར། །
en: They understand the entire process of death and rebirth, And by renouncing it they reach buddhahood.”

source: ཁྱེའུ་དེས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་མ་ཐག་ཏུ་དེ་ནས་སྐད་ཅིག་དེ་དང་ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་ཚོང་དཔོན་སེང་གེ་ལྟ་བུ་རང་གི་འཁོར་གྱིས་ཡོངས་སུ་བསྐོར་བ་དང་། སྲོག་ཆགས་ཉིས་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་སེམས་ཡོངས་སུ་བསྔོས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: As soon as the child had spoken these verses, right then, at that very instant, the eminent merchant Leonine, his entire entourage, and two thousand other beings developed the mind set on unsurpassed, completely perfect awakening, and with their minds thus fully committed, they reached the acceptance of the unborn nature of phenomena.

source: ལྷ་བྱེ་བ་ཕྲག་བརྒྱད་ཀྱིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཉིད་དུ་ངེས་པར་གྱུར་ཏོ། །
en: Eighty million gods also generated the mind set on unsurpassed, completely perfect awakening and became certain of irreversibility on the path to unsurpassed, completely perfect awakening.

source: སྲོག་ཆགས་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བཞི་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ། །
en: And forty quadrillion living beings were able to see phenomena with Dharma eyes, free of dust, pure, undefiled, and immaculate.

source: དེ་ནས་ཁྱེའུ་དེས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ཤཱཀྱ་སེང་གེའི་སྤྱན་སྔ་འདིར། །ཁོ་བོ་འོངས་པ་དེ་དོན་ཡིན། །སྲོག་ཆགས་ཁྲག་ཁྲིག་འཁོར་བ་ཡི། །འཇིགས་པ་ཆེ་ལས་ཐར་གྱུར་ཅིང་། །
en: The child then spoke these verses: “The reason I came here Was to enter the presence of the lion of the Śākyas, Who has freed millions upon millions of beings From the terrors of saṃsāra.

source: སྲོག་ཆགས་བྱེ་བ་མང་པོ་རྣམས། །བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ། །སེམས་བསྐྱེད་པ་ཡང་སྐྱེས་གྱུར་ཏེ། །བཟོད་པ་ལ་ཡང་རབ་ཏུ་བཀོད། །
en: “Many millions among them, With the mind set on unsurpassed awakening, A re now well established At the level of acceptance.

source: བདག་གི་ཕ་མ་ཕུ་ནུ་དང་། །ཉེ་དུ་རྣམས་ཀྱང་བཟོད་ལག་ན་གནས། །བྱེ་བ་ཕྲག་བརྒྱད་ལྷ་རྣམས་ནི། །ཐམས་ཅད་བྱང་ཆུབ་རབ་ཏུ་ཞུགས། །
en: “My own parents, siblings, and relatives Are also settled in acceptance, And all eighty million gods Have embarked upon awakening.

source: དཔག་མེད་བསམ་གྱིས་མི་ཁྱབ་པའི། །ནོར་གྱི་ཕུང་པོ་ཆེ་རྙེད་པས། །བདག་ནི་སངས་རྒྱས་ཆོས་རྣམས་ཀྱིས། །དབུལ་བ་ཐག་རིང་ཟད་པར་གྱུར། །དེ་ནས་ཁྱེའུ་རབ་ཏུ་ཞི་བར་གནས་ཀྱིས་ཕ་མ་དང་ཕུ་ནུ་དང་།
en: “In the teachings of the Buddha, I have found a great heap of precious jewels Inestimable and beyond imagination, So I am far from want.”

source: ཉེ་དུའི་ཚོགས་རྣམས་བོས་ཏེ་ཕ་མ་དང་། ཕུ་ནུ་དང་། ཉེ་དུ་དང་། རྩ་ལག་གི་སྐྱེ་བོ་རྣམས་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་བའི་སྲོག་ཆགས་འབུམ་ཕྲག་མང་པོས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་ནས་གྱད་རྣམས་དང་ཉེ་བ་ན་ཡོད་པ་ཤིང་སཱ་ལ་ཟུང་གི་ཚལ་ག་ལ་བ་དེར་དོང་ངོ་། །བཅོམ་ལྡན་འདས་སེང་གེའི་གཟིམས་ཁྲི་ལ་སྐུའི་གློ་གཡས་པས་ཕབ་སྟེ་གཟིམས་མ་ཐག་ཏུ་དེ་ནས་གཞན་ཡང་སྐད་ཅིག་དེ་དང་།
en: Then the child Thoroughly at Peace summoned his parents, siblings, and relatives, and escorted by his parents, siblings, relatives, kinsmen, and an entourage of many hundreds of thousands of beings who pay homage at the feet of the Blessed One, he left the great city of Śrāvastī and journeyed to the Yamakaśāla Grove in the country of the Mallas.

source: ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་འབུམ་ཕྲག་བརྒྱད་འདས་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགའ་བའི་དབང་ཕྱུག་ཅེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་འཇིག་རྟེན་གྱི་ཁམས་དགའ་སྤུ་ཞེས་བྱ་བ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་ཅེས་བྱ་བ་ཤི་འཕོས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་འཛམ་བུའི་གླིང་འདི་ཉིད་དུ་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་ཆེན་པོར་ཚོང་དཔོན་མེ་ཏོག་བཟང་པོ་ཞེས་བྱ་བའི་ཁྱིམ་དུ་སྐྱེས་སོ། །
en: As soon as the Blessed One had lain down on his right side upon the lion couch, at that very moment, right then, at that very instant, eight trillion buddha fields away to the west, in the world called Joy, the buddha field of the thus-gone, worthy, perfect buddha Lord of Joy, a bodhisattva great being called Without Reference passed away and was reborn here in this buddha field of Jambudvīpa, in the great city of Vārāṇasī, in the household of the eminent merchant called Excellent Flower.

source: དེ་ནས་ཁྱེའུ་དེ་སྐྱེས་མ་ཐག་ཏུ་དེའི་ཚེ་ཆེད་དུ་བརྗོད་པ་འདི་ཆེད་དུ་བརྗོད་དོ། །བདག་མེད་མི་གཡོའི་ཆོས་སྟོན་པ། །རྣམ་པར་འདྲེན་པ་སངས་རྒྱས་ནི། །སཱ་ལའི་ལྗོན་ཤིང་ཚལ་ཁྲོད་དུ། །དེ་རིང་མྱ་ངན་འདའ་བར་འགྱུར། །
en: As soon as the child was born, he spoke up, and he spoke with purpose: “The Buddha, our guide, The teacher of the Dharma of unwavering selflessness, Will pass into nirvāṇa today Amidst a grove of śāla trees.

source: ཆོས་རྣམས་འདི་དག་དམིགས་མེད་ན། །མི་མཁས་དམིགས་པར་བྱེད་པ་དག །དེ་དག་སྡུག་བསྔལ་མི་གྲོལ་ཞིང་། །དེ་དག་རྣམས་ཀྱི་སྡུག་བསྔལ་འཕེལ། །
en: “If all phenomena are beyond reference points, The unlearned who make reference points Will not be freed from suffering— Their suffering will only increase.

source: ཆོས་རྣམས་ཐམས་ཅད་གནས་མིན་ཏེ། །དེ་དག་རྣམས་ཀྱི་གནས་ཀྱང་མེད། །
en: “All phenomena are ephemeral; There is no place where they abide.

source: ཟད་པ་དང་ནི་མ་ཟད་པ། །ཐམས་ཅད་འདི་ལ་རྙེད་མི་འགྱུར། །
en: Neither that which is already exhausted nor that which is yet to be exhausted Is to be found.

source: སྟོང་པ་ནམ་ཡང་མི་འཇིག་ཅིང་། །སྟོང་པ་རྣམ་པར་འཇིག་པའང་མེད། །
en: “Emptiness is never destroyed; Emptiness does not disintegrate.

source: དེ་ལ་རྐྱེན་ཀྱང་ཡོད་མིན་ཞིང་། །རྐྱེན་མེད་པ་ཡང་དེ་ལ་མེད། །
en: It neither has conditions, Nor is it without conditions.

source: གང་གིས་ཞི་བ་མཐོང་དཀའ་ཞིང་། །ཟབ་མོའི་ཆོས་འདི་བསྟན་མཛད་པ། །ཤཱཀྱ་སེང་གེ་མི་ཡི་མཆོག །རྫོགས་པའི་སངས་རྒྱས་བཞུགས་སམ་ཅི། །
en: “He who revealed peace, so hard to see, Through this profound doctrine— The lion of the Śākyas, the best of men, The perfect Buddha—is he still here?

source: སེང་གེ་ཆེན་པོ་གླང་པོ་ཆེ། །ཚངས་པར་གྱུར་ཅིང་ཟག་པ་མེད། །མིག་ཏུ་གྱུར་པ་དེ་རིང་ནི། །སཱ་ལའི་བར་དུ་འདའ་བར་འགྱུར། །
en: “The great lion, the elephant Who has become pure, Whose vision has become flawless, Will today pass away between the śāla trees.

source: དགེ་སློང་དགེ་འདུན་མདུན་དག་ན། །ཟླ་བ་ཉ་བ་འདྲ་བར་ནི། །ཡུན་རིང་ཆོས་རྣམས་སྟོན་མཛད་པ། །ཕྱིན་ཆད་མཐོང་བར་མི་འགྱུར་རོ། །
en: “He who, like a full moon, Gave teachings for so long Before the community of monks Henceforth shall be seen no more.

source: ལྷུན་པོའི་སྒང་ན་ནོར་ལྷ་ལྟར། །དགེ་སློང་ཚོགས་ལ་རྣམ་མཛེས་པ། །ལེགས་པར་གསུང་པ་མགོན་པོ་ནི། །ཕྱིན་ཆད་གྲོང་ཁྱེར་གཤེགས་མི་འགྱུར། །
en: “He who glorified the monastic assembly Like a wealth deity atop a mountain peak, The protector, the eloquent teacher, Henceforth shall visit the city no more.

source: ལྷ་མིའི་མདུན་ན་སྐྱོབ་པ་ཡི། །བླ་མེད་ཆོས་ཀྱི་ང་རོ་དང་། །དགའ་བར་མཛད་པའི་གསུང་དབྱངས་ཏེ། །ཕྱིན་ཆད་ཐོས་པར་མི་འགྱུར་རོ། །
en: “Before gods and humans, The roar of the protector’s unsurpassed doctrine, The melodious speech that brings delight, Henceforth shall be heard no more.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་ཀྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་ཆེན་པོའི་སྲོག་ཆགས་འབུམ་ཐམ་པས་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ། །གང་གི་ཕྱིར་ཁྱེའུ་འདི་སྐྱེས་མ་ཐག་ཏུ་དེ་ལྟར་སྔོན་གྱི་གནས་ཀྱི་ཚེ་རབས་དེ་དང་དེ་དག་རྗེས་སུ་དྲན་ཞིང་།
en: As soon as the bodhisattva great being Without Reference had uttered these verses, a hundred thousand people in the great city Vārāṇasī exclaimed, “How is it that this child can remember his past lives as soon as he is born?

source: འདིའི་ཤེས་པ་དང་མི་འཇིགས་པའི་སྟོབས་བསྐྱེད་པ་དེས་ཚིག་འབྲུ་སྣ་ཚོགས་ཀྱིས་ཚིགས་སུ་བཅད་པ་དེ་ལྟ་བུ་དག་རྗོད་པར་བྱེད་པའི་ཤེས་རབ་ཀྱི་སྤོབས་པ་དང་། ཤེས་རབ་ཀྱི་མི་འཇིགས་པ་དང་ཤེས་རབ་ཀྱི་ཁྱད་པར་ནི་ངོ་མཚར་ཏེ།
en: The eloquence of insight, the fearlessness of insight, and the extraordinary insight with which he has spoken these verses, with their various expressions—with such power of understanding and such fearlessness— is truly amazing!

source: བདག་ཅག་གིས་ཀྱང་དེ་ལྟ་བུའི་ཤེས་རབ་ཡང་དག་པར་བསྒྲུབ་པའི་ཕྱིར་ངེས་པར་འབད་པར་བྱའོ་ཞེས་སྨྲས་སོ། །
en: We, too, must surely strive to fully achieve such insight!”

source: དེ་ནས་ཁྱེའུ་དེས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་འདི་ལྟ་སྟེ། མཐའ་ཡས་མུ་མེད་པ་དང་། སྣང་བ་མེད་པ་དང་། དམིགས་པ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་ལ་བཟོད་པའི་ཕྱིར་མི་ལྡོག་པ་དང་།
en: Then the child declared to the amassed crowd of people, “Acceptance that all is infinite and boundless, invisible, without reference points, and unborn is to reach irreversibility on the path.

source: ཐུན་མོང་མ་ཡིན་པ་དང་། མི་མཉམ་པ་དང་མཉམ་པ་ལ་བཀོད་པ་དང་། དེ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: It is no ordinary thing; it is equal to the unequaled.”

source: བདག་ཅག་ཐམས་ཅད་ཀྱང་ཚོགས་པར་བྱས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱའོ། །དེས་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: They replied, “All of us gathered here will set our minds on unsurpassed, completely perfect awakening!”

source: ཁྱེད་ཅག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཟིན་གྱིས་ཁྱེད་ཅག་ཚུར་ཤོག་དང་།
en: The child said to them, “All of you, who have set your minds on unsurpassed, completely perfect awakening, come this way!

source: ད་བདག་ཅག་ཐམས་ཅད་ཚོགས་པར་བྱས་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འགྲོགས་ཏེ་འདོང་ངོ་། །
en: We have gathered together, now let us travel together to see, pay homage, and serve the Blessed One, the thus-gone, worthy, perfect Buddha.”
